aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/shift.c
    u16_shift_s_auto_position_cnt = (u16)0;
    u8_shift_s_shift_dir = SHIFT_POSITION_UP;
    u8_shift_g_blip_complete = SET;
    u8_shift_s_shifting_complete = SET;
    u16_shift_s_blip_timeout_cnt = (u16)0;

    u8_shift_s_posision_start_reset_req = CLEAR;
}

/**************************************************************/
/*  Function:                                                 */
/*  main関数                                                   */
/*                                                            */
/*                                                            */
/**************************************************************/
void func_shift_g_main( void )
{
    func_shift_s_shift_sequence();              /* 変速シーケンス制御 */        /* エンジン制御はこの処理が主体になるはず。 */

    func_shift_s_shift_mode_decide();           /* 変則モード確定処理 */
    func_shift_s_shift_position_req_decide();   /* シフト位置要求設定処理 */
    func_shift_s_shift_dir_judge();             /* 変速方向判定処理 */

    /* 出力制御 */
    func_shift_s_clutch_control();              /* クラッチ制御 */
    func_shift_s_blip_control();                /* ブリッピング制御 */
    func_shift_s_shift_position_control();      /* シフト位置出力制御 */
    func_shift_s_neutral_judge_control();       /* ニュートラル状態制御 */
}

/**************************************************************/
/*  Function:                                                 */
/*  関数                                                      */
/*  シフト位置を確定させる                                      */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_position_req_decide( void )
{
    if( u8_shift_g_shift_mode == SHIFT_MODE_MANUAL )
    { /* マニュアルシフト */
        func_shift_s_shift_position_decide_mode_manual();
    }
    else if( u8_shift_g_shift_mode == SHIFT_MODE_AUTOMATIC )
    {
        func_shift_s_shift_position_decide_mode_automatic();
    }
    else
    {
        ;
    }
}

/**************************************************************/
/*  Function:                                                 */
/*  シフト位置確定制御 マニュアルバージョン                       */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_position_decide_mode_manual( void )
{
    if( u8_shift_s_posision_start_reset_req == SET )
    { /* シフト位置リセット要求が発生 */
        u8_shift_g_shift_position_req = SHIFT_MANUAL_START_SHIFT_POSI;               /* 初期位置：ニュートラルを指定 (空ぶかし許可) */
    }
    else if( ( gpio_g_paddle_shift_sw.u8_state == LOW ) &&
             ( gpio_g_paddle_shift_sw.u8_state_bf == MID ))
    { /* シフトアップ */
        if( u8_shift_g_shift_position_req < SHIFT_POSI_8 )
        {
            u8_shift_g_shift_position_req++;
        }
        else
        {
            u8_shift_g_shift_position_req = SHIFT_POSI_8;
        }
    }
    else if( ( gpio_g_paddle_shift_sw.u8_state == HI ) &&
             ( gpio_g_paddle_shift_sw.u8_state_bf == MID ))
    { /* シフトダウン */
        if( u8_shift_g_shift_position_req > SHIFT_POSI_0 )
        {
            u8_shift_g_shift_position_req--;
        }
        else
        {
            u8_shift_g_shift_position_req = SHIFT_POSI_0;
        }
    }
    else
    { /* 要求なし */
        ;               /* 現在のシフト位置を維持 */
    }
}

/**************************************************************/
/*  Function:                                                 */
/*  シフト位置確定制御 オートマチックバージョン                   */
/*  一番ここが複雑になるかも                                    */
/**************************************************************/
static void func_shift_s_shift_position_decide_mode_automatic( void )
{
    u16 u16_shift_up_thr_speed;
    u16 u16_shift_down_thr_speed;
    u8 u8_shift_chg_dir;
    u16 u16_shift_his_speed;
    u32 u32_calc_buff;
    
    u16 u16_shift_thr_speed_his;        /* 変速閾値ヒステリシス */
    
    u16 u16_position_rpm_1minus;
    u16 u16_position_rpm_1plus;

    u8 u8_shift_position_req_before;
    
    
    /* 変速位置固定カウント */
    /* 変速後は一定時間変速を許可しない */
    if( u16_shift_s_auto_position_cnt < U16_MAX )
    {
        u16_shift_s_auto_position_cnt++;
    }
    
    
    /* 実際には、この関数内で回転数がついてこれなければ、勝手に減速する仕様となる */

    /* シフトチェンジのレブリミットレベルを算出する */
    /* ただし、現在のギヤ位置から見て、最大出力で到達できそうな回転数範囲に制限をかける */
    /* @@シフトダウンの下限値回転数が、１段下のシフトアップ回転数と被らないように注意する。実測合わせ要検討 */
    u32_calc_buff = (u32)0;
    u32_calc_buff = func_ud_g_calcmul_2x2_byte( (u16)u8_rc_g_ch_duty_tbl[RC_DUTY_CH_REV_LIMIT], (u16)SHIFT_POSI_CHG_HIS_MAX );
    u32_calc_buff = func_ud_g_calcdiv_4x4_byte( u32_calc_buff, (u32)RC_CH_DUTY_100P );
    u16_shift_thr_speed_his = (u16)u32_calc_buff;
    
    
    /* シフトチェンジの回転数閾値を計算する */
    if( u8_shift_g_shift_position_output == SHIFT_POSI_1 )
    { /* 現在1速：シフトアップのみ可能 */
        u16_shift_up_thr_speed   = u16_shift_s_shift_posi_50per_speed_ary[ SHIFT_POSI_1 ] + u16_shift_thr_speed_his;
        u16_shift_down_thr_speed = (u16)0;      /* @@ココの値どうしよう... */
    }
    else if( u8_shift_g_shift_position_output == SHIFT_POSI_7 )
    { /* 現在7速：シフトダウンのみ可能 */
        u16_shift_up_thr_speed   = U16_MAX;    /* ひとまず変速不可能な回転数にしておく */
        if( u16_shift_s_shift_posi_50per_speed_ary[ SHIFT_POSI_7 ] > u16_shift_thr_speed_his )
        {
            u16_shift_down_thr_speed = u16_shift_s_shift_posi_50per_speed_ary[ SHIFT_POSI_6 ] - u16_shift_thr_speed_his;
        }
    }
    else
    { /* "現在" 1～6速 */
        u16_shift_up_thr_speed = u16_shift_s_shift_posi_50per_speed_ary[ u8_shift_g_shift_position_output ] + u16_shift_thr_speed_his;
        u16_shift_down_thr_speed = u16_shift_s_shift_posi_50per_speed_ary[ u8_shift_g_shift_position_output ] - u16_shift_thr_speed_his;
    }
    
    /* 変速処理 */
    /* 変速要求設定 */
    u8_shift_position_req_before = u8_shift_g_shift_position_req;

    if( u16_shift_s_auto_position_cnt > SHIFT_POSI_REMAIN_CNT )
    { /* 変速後は少し間を置く */
        if( u16_speedsens_g_speed_ave_1stgear >= u16_shift_up_thr_speed )
        { /* シフトアップ閾値回転数を超えた */
            if( u8_shift_g_shift_position_req < SHIFT_POSI_8 )
            {
                u8_shift_g_shift_position_req++;
            }
            else
            {
                u8_shift_g_shift_position_req = SHIFT_POSI_8;
            }
        }
        else if( u16_speedsens_g_speed_ave_1stgear <= u16_shift_down_thr_speed )
        {
            if( u8_shift_g_shift_position_req > SHIFT_POSI_1 )
            {
                u8_shift_g_shift_position_req--;
            }
            else
            {
                u8_shift_g_shift_position_req = SHIFT_POSI_1;
            }
        }
        else
        { /* 50%出力での変速域内 */
            ;       /* 現在のシフトポジションを維持 */
        }
    }


    /* 始動時の初期位置設定 */      //とりあえずここに置いておく
    if( u8_shift_s_posision_start_reset_req == SET )
    { /* シフト位置リセット要求が発生 */
        u8_shift_g_shift_position_req = SHIFT_POSI_1;                       /* スロットル入力が発生したら自動で1速へ初期設定 */
    }
    else if( ( u8_sc_g_throttle_rc_ch_duty_target == RC_CH_DUTY_0P ) &&     /* 指令入力がない */
             ( u16_speedsens_g_speed_ave_1stgear == (u16)0 ) )              /* 車体が停止状態 */
    {
        u8_shift_g_shift_position_req = SHIFT_POSI_0;
    }


    /* 変速発生時の処理 */
    if( u8_shift_position_req_before != u8_shift_g_shift_position_req )
    { /* シフト位置の更新があった */
        u16_shift_s_auto_position_cnt = (u16)0;
    }
}


/**************************************************************/
/*  Function:                                                 */
/*  シフト位置出力処理                                          */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_position_control( void )
{
    if( u8_shift_s_posision_start_reset_req == SET )
    {
        u8_shift_g_shift_position_output = u8_shift_g_shift_position_req;       /* 変速状態を直ちに反映 */
        u8_shift_s_posision_start_reset_req = CLEAR;                                  /* 要求クリア */
    }


    if( u8_shift_g_shifting_sequence == SHIFT_SEQ_CLUTCH_OFF_SHIFT_CHG )
    { /* 変速シーケンス内 / ブリッピング完了 */
        if( u8_shift_g_blip_complete == SET )
        { /* 変速シーケンスにきてブリッピング完了している */
            u8_shift_g_shift_position_output = u8_shift_g_shift_position_req;
            u8_shift_s_shifting_complete = SET;                 /* 変速完了 */
        }
        else
        {
            u8_shift_s_shifting_complete = CLEAR;               /* 変速完了 */
        }
    }
    else
    {
        u8_shift_s_shifting_complete = CLEAR;           /* ひとまず変速なしの時は検完了扱い(使ってない) */
    }

    /* ニュートラル出力設定 */
    if( u8_shift_g_shift_position_output == SHIFT_POSI_0 )
    { /* 現在 0速 */
        U8_GPIO_G_OUT_NEUTRAL = SET;        /* 強制ニュートラル信号を出力 */
    }
    else
    {
        U8_GPIO_G_OUT_NEUTRAL = CLEAR;
    }
    

    /* 0bit目 */
    if( ( u8_shift_g_shift_position_output & ((u8)0x01) ) != (u8)0 )
    { /* 0bit目が立っている */
        U8_GPIO_G_OUT_SHIFT_0 = SET;
    }
    else
    {
        U8_GPIO_G_OUT_SHIFT_0 = CLEAR;
    }

