aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/shift.c
    /* 1bit目 */
    if( ( u8_shift_g_shift_position_output & ((u8)0x02) ) != (u8)0 )
    { /* 0bit目が立っている */
        U8_GPIO_G_OUT_SHIFT_1 = SET;
    }
    else
    {
        U8_GPIO_G_OUT_SHIFT_1 = CLEAR;
    }

    /* 2bit目 */
    if( ( u8_shift_g_shift_position_output & ((u8)0x04) ) != (u8)0 )
    { /* 0bit目が立っている */
        U8_GPIO_G_OUT_SHIFT_2 = SET;
    }
    else
    {
        U8_GPIO_G_OUT_SHIFT_2 = CLEAR;
    }
}


/**************************************************************/
/*  Function:                                                 */
/*  ニュートラル状態 制御                                       */
/*  若干特殊な状態なので、変速シーケンス制御とは分ける             */
/**************************************************************/
static void func_shift_s_neutral_judge_control( void )
{
    if( u8_shift_g_shift_mode == SHIFT_MODE_MANUAL )
    { /* マニュアルシフト */
        /* 0速スタートにしたい。ニュートラルを知れて空ぶかしできるようにしておきたい。 */








    }
    else if( u8_shift_g_shift_mode == SHIFT_MODE_AUTOMATIC )
    { /* オートマチックシフト */
        if( u16_speedsens_g_speed_ave_1stgear == (u16)0 )
        { /* ほぼ停止状態 ※シフト位置は0に戻ってるはず... */
            
        }
    }
    else
    {
        ;
    }
}


/**************************************************************/
/*  Function:                                                 */
/*  変速モード確定関数                                          */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_mode_decide( void )
{
    u8 u8_mode_before;

    u8_mode_before = u8_shift_g_shift_mode;

    if( u8_shift_s_shift_chg_enable_wait_cnt < U8_MAX )
    {
        u8_shift_s_shift_chg_enable_wait_cnt++;
    }
    
    /* 変速モード変更要求 */
    if( gpio_g_shift_mode_sw.u8_state == HI )
    {
        u8_shift_s_shift_mode_req = SHIFT_MODE_MANUAL;
    }
    else
    {
        u8_shift_s_shift_mode_req = SHIFT_MODE_AUTOMATIC;
    }

    /* 停止状態でのみ、シフト操作モードの変更を許可する */
    if( ( u8_shift_s_shift_chg_enable_wait_cnt >= SHIFT_DRIVE_STOP_CNT ) &&
        ( u16_speedsens_g_speed_ave_1stgear == SHIFT_DRIVE_STOP_SPEED ) )               /* 1次ギヤで止まってる判定する場合、0,1,2のシフトレバーが接続状態でないとダメなので、条件としては微妙かも */
    { /* 現在車は停止している */
        u8_shift_g_shift_mode = u8_shift_s_shift_mode_req;          /* 現在の変速モード要求を反映する */
    }

    if( u8_mode_before != u8_shift_s_shift_chg_enable_wait_cnt )
    { /* 変速モードに変化があった */
        u8_shift_s_shift_chg_enable_wait_cnt = (u8)0;       /* クリア */
    }
}


/**************************************************************/
/*  Function:                                                 */
/*  クラッチサーボ制御状態更新処理                               */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_sequence( void )
{
    /* 前回までのシーケンスを保存 */
    u8_shift_g_shifting_sequence_before = u8_shift_g_shifting_sequence;

    /* シーケンス管理 */
    switch ( u8_shift_g_shifting_sequence )
    {
        case SHIFT_SEQ_CLUTCH_OFF_STOP:
            /* 車体が完全に停止状態のときのみ、ここに来ているとして設計 */
            if( u8_sc_s_throttle_dir != SC_THROTTLE_DIR_NONE )
            { /* スロットル中立ではなくなった */
                if( u8_shift_s_shift_mode_req == SHIFT_MODE_AUTOMATIC )
                { /* 現在オートマ選択中 */
                    u8_shift_s_posision_start_reset_req = SET;                      /* アクセルONで即始動させる必要があるので、初期変速要求(始動時のギヤ位置を指定する) */
                    u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_MEETING;        /* クラッチミート開始 */
                }
                else if( u8_shift_s_shift_mode_req == SHIFT_MODE_MANUAL )
                { /* 現在マニュアル選択中 */
                    /* 始動時は初期ギヤ位置での発進のみ許可する設計としておく */
                    if( u8_sc_s_throttle_dir_before == SC_THROTTLE_DIR_NONE )
                    { /* アクセル踏んだ初回：前回はアクセル踏んでなかった */
                        if( u8_shift_g_shift_position_req != SHIFT_MANUAL_START_SHIFT_POSI )
                        { /* シフト位置が初期値と異なる */
                            u8_shift_s_posision_start_reset_req = SET;                  /* 初回は空ぶかし許可したいので、初期変速要求(始動時のギヤ位置を指定する) */
                        }
                    }
                    else /* (u8_sc_s_throttle_dir!=SC_THROTTLE_DIR_NONE) && (u8_sc_s_throttle_dir_before!=SC_THROTTLE_DIR_NONE) */
                    { /* アクセルをふかし続けている状態でシフトアップ発生 */
                        if( u8_shift_g_shift_position_output != u8_shift_g_shift_position_req )
                        {
                            u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_MEETING;        /* クラッチミート開始 */    /* ※ニュートラル状態だけいきなりつなぐような設計は微妙かも、ここだけシーケンス度外視している。 */
                        }                                                                                               /* @@SHIFT_SEQ_CLUTCH_OFF_AFTER_CHG の内部で、スロットル入力がある状態で変速していたら、MEETING...としたほうがきれいな感じがする。 */
                    }
                }
            }
            else if( u8_shift_g_shift_position_output != u8_shift_g_shift_position_req )
            { /* 停止状態で シフトポジション要求が変化 */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_BFORE_CHG;            /* クラッチOFFへ */
            }
            else
            {
                ;       /* 待機 */
            }
            break;

        case SHIFT_SEQ_CLUTCH_MEETING:
            /* 始動時のクラッチミート */
            if( u8_shift_s_clutch_meet_complete == SET )
            { /* 半クラッチ完了 */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_ON_DRIVE;
            }
            break;
        
        case SHIFT_SEQ_CLUTCH_ON_DRIVE:
            u16_shift_s_clutch_off_cnt = (u16)0;

            /* 駆動中は常時変速許可 */
            if( u8_shift_g_shift_position_output != u8_shift_g_shift_position_req )
            { /* シフトポジション要求が変化 */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_BFORE_CHG;            /* クラッチOFFへ */
            }

            if( u16_speedsens_g_speed_ave_1stgear == (u16)0 )
            { /* 車が完全に停止した */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_STOP;             /* クラッチ切る */
            }
    #if 0
            /* クラッチキック要求 */
            else if(  )
            {
                u8_shift_s_shifting_status = SHIFT_SEQ_CLUTCH_OFF_KICK;            /* クラッチOFFへ */
            }
    #endif
            break;
        
        case SHIFT_SEQ_CLUTCH_OFF_BFORE_CHG:
            /* シフトチェンジ前のクラッチOFF */
            if( u16_shift_s_clutch_off_cnt < U16_MAX )
            {
                u16_shift_s_clutch_off_cnt++;
            }

            if( u16_shift_s_clutch_off_cnt > SHIFT_CLUTCH_ON_TO_OFF_WAIT_TIME )
            { /* クラッチOFFを最低維持する時間経過：サーボの動作応答を待つ */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_SHIFT_CHG;
                u16_shift_s_clutch_off_cnt = (u16)0;
            }
            break;

        case SHIFT_SEQ_CLUTCH_OFF_SHIFT_CHG:
            /* シフトチェンジ */
            /*u8_shift_g_shift_position_output = u8_shift_g_shift_position_req;*/       /* シフト要求を反映 */      /* func_shift_s_shift_position_control() 側で制御 */
            if( ( u8_shift_g_blip_complete == SET ) &&              /* ブリッピング完了 */
                ( u8_shift_s_shifting_complete == SET ) )           /* 変速完了 */
            { /*  */
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_AFTER_CHG;
            }
            break;

        case SHIFT_SEQ_CLUTCH_OFF_AFTER_CHG:
            /* シフトチェンジ後のクラッチOFF */
            if( u16_shift_s_clutch_off_cnt < U16_MAX )
            {
                u16_shift_s_clutch_off_cnt++;
            }
            if( u16_shift_s_clutch_off_cnt > SHIFT_CLUTCH_OFF_TO_ON_WAIT_TIME )
            { /* クラッチOFFを最低維持する時間経過：変速用サーボの動作応答を待つ */
                if( u16_speedsens_g_speed_ave_1stgear == (u16)0 )
                { /* 車が完全に停止した状態での変速だった */
                    u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_OFF_STOP;                 /* クラッチ切った状態での停止状態へ戻る */
                }
                else if( u16_speedsens_g_speed_ave_1stgear < (u16)1000 )
                { /* 車が動作中の変速ではあるが、あまり速度が出ていない */
                    u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_MEETING;                  /* 半クラッチで繋ぐ */
                }
                else
                { /* 速度が十分に出た状態での変速 */
                    u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_ON_DRIVE;                 /* すぐにクラッチ繋ぐ */
                }
                
                u16_shift_s_clutch_off_cnt = (u16)0;
            }
            break;

        case SHIFT_SEQ_CLUTCH_OFF_KICK:
            /* 過負荷気味なときのクラッチキック操作 */
            if( u16_shift_s_clutch_off_cnt < U16_MAX )
            {
                u16_shift_s_clutch_off_cnt++;
            }
            if( u16_shift_s_clutch_off_cnt > SHIFT_CLUTCH_OFF_TIME_KICK )
            {
                u8_shift_g_shifting_sequence = SHIFT_SEQ_CLUTCH_MEETING;
                u16_shift_s_clutch_off_cnt = (u16)0;
            }

            break;

        default:
            break;
    }
}


/**************************************************************/
/*  Function:                                                 */
/*  変速方向確認                                               */
/*                                                            */
/**************************************************************/
static void func_shift_s_shift_dir_judge( void )
{
    if( u8_shift_g_shift_position_req > u8_shift_g_shift_position_output )
    { /* シフトアップ中 */
        u8_shift_s_shift_dir = SHIFT_POSITION_UP;
    }
    else if( u8_shift_g_shift_position_req < u8_shift_g_shift_position_output )
    { /* シフトダウン */
        u8_shift_s_shift_dir = SHIFT_POSITION_DOWN;
    }
    else /* ( u8_shift_g_shift_position_req == u8_shift_g_shift_position_output ) */
    { /*  */
        u8_shift_s_shift_dir = SHIFT_POSITION_STABLE;
    }
}

/**************************************************************/
/*  Function:                                                 */
/*  ブリッピング制御要求                                        */
/*                                                            */
/**************************************************************/
static void func_shift_s_blip_control( void )
{
    u8 u8_blip_cmp;
    u16 u16_calc_buff;

