aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/shift.c
    /* 初期化 */
    u8_blip_cmp = CLEAR;

    if( u8_shift_g_shifting_sequence == SHIFT_SEQ_CLUTCH_OFF_SHIFT_CHG )
    { /* 変速シーケンス内 */
        /* タイムアウト判定用 */
        if( u16_shift_s_blip_timeout_cnt < U16_MAX )
        {
            u16_shift_s_blip_timeout_cnt++;
        }

        if( u16_shift_s_blip_timeout_cnt < SHIFT_BLIP_TIMEOUT )
        { /* ブリッピング有効時間内 */
#if 0
            /* こっちのほうが実装単純 */
            if( u8_shift_s_shift_dir == SHIFT_POSITION_UP )
            { /* シフトアップしようとしている */
                if( u16_speedsens_g_speed_ave_mtr < u16_speedsens_g_speed_ave_1stgear )
                { /* エンジン回転数 < 負荷軸側回転数 になるまで回転数が下がった */
                    u8_blip_cmp = SET;
                }
            }
            else if( u8_shift_s_shift_dir == SHIFT_POSITION_DOWN )
            { /* シフトダウンしようとしている */
                if( u16_speedsens_g_speed_ave_mtr > u16_speedsens_g_speed_ave_1stgear )
                { /* エンジン回転数 > 負荷軸側回転数 になるまで回転数が上がった */
                    u8_blip_cmp = SET;
                }
            }
#else
            /* モータとギヤの回転数の一致度合いを判断 */
            if( u16_speedsens_g_speed_ave_mtr > u16_speedsens_g_speed_ave_1stgear )
            {
                u16_calc_buff = u16_speedsens_g_speed_ave_mtr - u16_speedsens_g_speed_ave_1stgear;
            }
            else
            {
                u16_calc_buff = u16_speedsens_g_speed_ave_1stgear - u16_speedsens_g_speed_ave_mtr;
            }

            if( u16_calc_buff < SHIFT_BLIP_SPEED_ACCURACY )     /* PIの応答にもよるが、大体で合わせる */
            { /* 大体回転数あってる */
                u8_blip_cmp = SET;
            }
#endif
        }
        else
        { /* ブリッピングできていなくても、変速完了させる */
            u8_blip_cmp = SET;        /* @@デバッグ時は一時無効化したほうがよさそう */
        }
    }
    else
    {
        u8_blip_cmp = SET;          /* 変速時以外は使わないが、一応完了側に振っておく */
        u16_shift_s_blip_timeout_cnt = (u16)0;
    }

    u8_shift_g_blip_complete = u8_blip_cmp;
}

/**************************************************************/
/*  Function:                                                 */
/*  クラッチサーボ制御処理                                      */
/*                                                            */
/**************************************************************/
static void func_shift_s_clutch_control( void )
{
    u8 u8_clutch_angle_req;
    u8 u8_clutch_meet_angle_idx_diff;
    u8 u8_clutch_meet_dir_prop;
    u8 u8_clutch_servo_angle_idx_result;
    u16 u16_clutch_meet_time_base;
    u16 u16_clutch_meet_time_gap;
    u32 u32_calc_buff;

    /* 初期化 */
    u8_clutch_angle_req = (u8)0;
    u8_clutch_meet_angle_idx_diff = (u8)0;
    u8_clutch_meet_dir_prop = SET;
    u8_clutch_servo_angle_idx_result = (u8)0;
    u16_clutch_meet_time_base = (u16)0;
    u16_clutch_meet_time_gap  = (u16)0;
    u32_calc_buff = (u32)0;


    /*-----------------------------------------------------------------------*/
    switch ( u8_shift_g_shifting_sequence )
    {
        case SHIFT_SEQ_CLUTCH_OFF_STOP:
        case SHIFT_SEQ_CLUTCH_OFF_BFORE_CHG:
        case SHIFT_SEQ_CLUTCH_OFF_AFTER_CHG:
        case SHIFT_SEQ_CLUTCH_OFF_SHIFT_CHG:
        case SHIFT_SEQ_CLUTCH_OFF_KICK:
            u16_shift_s_clutch_meet_cnt = (u16)0;
            u8_shift_s_clutch_meet_complete = CLEAR;
            u8_clutch_servo_angle_idx_result = SHIFT_SERVO_ANGLE_CLUTCH_OFF;
            break;

        case SHIFT_SEQ_CLUTCH_MEETING:
            /* クラッチ角度を時間基準で制御する */
            if( u16_shift_s_clutch_meet_cnt < U16_MAX )
            {
                u16_shift_s_clutch_meet_cnt++;
            }
            u16_clutch_meet_time_base = SHIFT_CLUTCH_MEET_TIME;
            u16_clutch_meet_time_gap = u16_shift_s_clutch_meet_cnt;

            /* 角度基準 ※角度idx基準 */
            if( SHIFT_SERVO_ANGLE_CLUTCH_ON > SHIFT_SERVO_ANGLE_CLUTCH_OFF )
            { /* ONで角度が増える方向 */
                u8_clutch_meet_angle_idx_diff = (u8)( SHIFT_SERVO_ANGLE_CLUTCH_ON - SHIFT_SERVO_ANGLE_CLUTCH_OFF );     /* ここに来る場合は定義された値がCLUTCH_OFFのほうが大きいときなので問題なし */
                u8_clutch_meet_dir_prop = SET;              /* 比例増加 */
            }
            else
            { /* ONで角度が減る方向 */
                u8_clutch_meet_angle_idx_diff = (u8)( SHIFT_SERVO_ANGLE_CLUTCH_OFF - SHIFT_SERVO_ANGLE_CLUTCH_ON );     /* ここに来る場合は定義された値がCLUTCH_OFFのほうが大きいときなので問題なし */
                u8_clutch_meet_dir_prop = CLEAR;            /* 比例減少 */
            }

            /* 基準に対する現在の制御量を取得 */
            u32_calc_buff = func_ud_g_calcmul_2x2_byte( u16_clutch_meet_time_gap, (u16)u8_clutch_meet_angle_idx_diff );
            u32_calc_buff = func_ud_g_calcdiv_4x4_byte( u32_calc_buff, (u32)u16_clutch_meet_time_base );

            /* 出力 */
            if( u8_clutch_meet_dir_prop == SET )
            { /* 時間に比例して角度上げる */
                u8_clutch_servo_angle_idx_result = SHIFT_SERVO_ANGLE_CLUTCH_OFF + (u8)u32_calc_buff;
            }
            else
            { /* 時間に比例して角度を下げる */
                u8_clutch_servo_angle_idx_result = SHIFT_SERVO_ANGLE_CLUTCH_OFF - (u8)u32_calc_buff;        /* ここに来る場合は定義された値がCLUTCH_OFFのほうが大きいときなので問題なし */
            }

            /* クラッチミート完了判定 */
            if( u16_shift_s_clutch_meet_cnt >= SHIFT_CLUTCH_MEET_TIME )
            { /* クラッチ結合時間経過 */
                u8_shift_s_clutch_meet_complete = SET;
            }
            break;

        case SHIFT_SEQ_CLUTCH_ON_DRIVE:
            u8_clutch_servo_angle_idx_result = SHIFT_SERVO_ANGLE_CLUTCH_ON;
            break;

        default:
            u8_clutch_servo_angle_idx_result = SHIFT_SERVO_ANGLE_CLUTCH_OFF;
            break;
    }

    /* サーボ角度出力 */
    servo_s_angle_set( u8_clutch_servo_angle_idx_result ,SERVO_CLUTCH );
}
